       01 CUSTOMER-RECORD.
          05 CUSTOMER-ID        PIC 9(6).
          05 NAME               PIC X(12).
          05 REGION             PIC X(3).
          05 BALANCE            PIC 9(7)   USAGE COMP-3.
          05 SIGNED-ZONED       PIC 9(4).
          05 START-DATE         PIC 9(7).
