      01 SMF-REC.
         05 SMF-TYPE        PIC 9(3).
         05 SMF-TIME        PIC 9(7).
         05 SMF-SUBTYPE     PIC 9(3).
         05 JOB-NAME        PIC X(8).
         05 USERID          PIC X(8).
         05 CPU-TIME        PIC 9(7)   USAGE COMP-3.
         05 IO-COUNT        PIC 9(8)   USAGE COMP.
         05 MSG-TEXT        PIC X(40).
